pip install numpy

In [1]:
import numpy as np
import pandas as pd

# Task1:There are three different dataframe in python and save them as three .csv files.

In [390]:
title = 'Project Dataframe' # Assign the name.
print(title.center(25))
# make a dataframe with values.
# cost has some empty values.
a ={'ID':pd.Series(['A001','A002','A003','A004','A005','A002','A005','A003','A001','A003','A001','A004','A004','A005']),
    'Project': pd.Series(['Project1','Project2','Project3','Project4','Project5',
                          'Project6','Project7','Project8','Project9','Project10','Project11','Project12','Project13','Project14']),
    'Cost':pd.Series([1002000,2000000,4500000,5500000,np.nan,680000,400000,350000,np.nan,300000,2000000,1000000,3000000,200000]),                                    
    'Status':pd.Series(['Finished','Ongoing','Finished','Ongoing','Finished','Failed','Finished','Failed','Ongoing',
                        'Finished','Failed','Ongoing','Finished','Finished'])}
b= pd.DataFrame(a)
b.style.hide(axis="index")  # hide the index number.
b.to_csv('Project_dataframe',index=False)
# Save the csv file with name project dataframe.

    Project Dataframe

In [391]:
title = 'Employee DataFrame' #  Name of Table.
print(title.center(25))
# Assign the values to the each column using the dictionary format
A1 = {'ID':pd.Series(['A001','A002','A003','A004','A005']),
                                   'Name':pd.Series(['John Atler','Alice Luxumberg','Tom Sebestine','Nina Adgra','Amy Johny']),
                                   'Gender':pd.Series(['M','F','M','F','F']),
                                   'City':pd.Series(['Paris','London','Berlin','Newyork','Madrid']),
                                   'Age':pd.Series([25,27,29,31,30])}
A2 = pd.DataFrame(A1) # Dataframe 
A2.style.hide(axis="index") # Hide the index number
A2.to_csv('Employee_dataframe',index = False) # Save csv file with assign name 
#df.to_csv('my_data.csv', index=False)

    Employee DataFrame

In [392]:
title = 'Seniority level DataFrame' # Name of the table
print(title.center(25))
# The table has two columns.
c = pd.DataFrame({'ID':pd.Series(['A001','A002','A003','A004','A005']),
                  'Designation level':pd.Series([2,2,3,2,3])})
c.style.hide(axis='index') # Hide the index
c.to_csv('Seniority_level_dataframe', index = False) # Save into csv format with name.

Seniority level DataFrame

In [393]:
pd.read_csv('Project_dataframe')

      ID    Project       Cost    Status
0   A001   Project1  1002000.0  Finished
1   A002   Project2  2000000.0   Ongoing
2   A003   Project3  4500000.0  Finished
3   A004   Project4  5500000.0   Ongoing
4   A005   Project5        NaN  Finished
5   A002   Project6   680000.0    Failed
6   A005   Project7   400000.0  Finished
7   A003   Project8   350000.0    Failed
8   A001   Project9        NaN   Ongoing
9   A003  Project10   300000.0  Finished
10  A001  Project11  2000000.0    Failed
11  A004  Project12  1000000.0   Ongoing
12  A004  Project13  3000000.0  Finished
13  A005  Project14   200000.0  Finished

# Task2: The cost column in the dataframe “Project” has some missing values.compute these missing values. Replace the missing values by running average.

In [193]:
len(b)

14

In [395]:
sum = 0 # Initial sum is zero
count = 0 

# Iteration 
for i in range(len(b)): # length is 14.
    if pd.isna(b.loc[i, 'Cost']): # find is any Nan value in the cost.
        # Replace NaN with running average of previous valid costs
        b.loc[i, 'Cost'] = sum / count
    else:
        # Update sum and count
        sum += b.loc[i, 'Cost']
        count += 1                 # increase the value by 1
# Round 'Cost' to integer value
b['Cost'] = b['Cost'].astype(int) # to get the outcome in interger value.
b

      ID    Project     Cost    Status
0   A001   Project1  1002000  Finished
1   A002   Project2  2000000   Ongoing
2   A003   Project3  4500000  Finished
3   A004   Project4  5500000   Ongoing
4   A005   Project5  3250500  Finished
5   A002   Project6   680000    Failed
6   A005   Project7   400000  Finished
7   A003   Project8   350000    Failed
8   A001   Project9  2061714   Ongoing
9   A003  Project10   300000  Finished
10  A001  Project11  2000000    Failed
11  A004  Project12  1000000   Ongoing
12  A004  Project13  3000000  Finished
13  A005  Project14   200000  Finished

# Task3: Split the name column in the Employee dataframe into two new columns “First Name”, and “LastName” and remove the older “name” column.

In [396]:
# split the column 'Name' into two columns i.e. first name and last name by the separator/delimiter 'Space'
A2[['First Name', 'Last Name']] = A2['Name'].str.split(' ', expand=True) 
# drop the column 'Name' from the dataframe
A3 = A2.drop('Name', axis='columns')
A3 # get the desired result

     ID Gender     City  Age First Name  Last Name
0  A001      M    Paris   25       John      Atler
1  A002      F   London   27      Alice  Luxumberg
2  A003      M   Berlin   29        Tom  Sebestine
3  A004      F  Newyork   31       Nina      Adgra
4  A005      F   Madrid   30        Amy      Johny

# Task4: Join all three dataframes in one single dataframe. Name it “Final”

In [397]:
#We have two functions for join all dataframes one is join() and other is merge(). for index based, use join() function. 
#But in this case, we have a common column "ID" in all the dataframe so we'll use merge () function for joining all the dataframes.
#As merge() is made for column-based joins.

Final = A3.merge(b, on="ID").merge(c, on="ID") # join all dataframes and assign the name 'Final'
Final # get the result.

,ID,Gender,City,Age,First Name,Last Name,Project,Cost,Status,Designation level
0,A001,M,Paris,25,John,Atler,Project1,1002000,Finished,2
1,A001,M,Paris,25,John,Atler,Project9,2061714,Ongoing,2
2,A001,M,Paris,25,John,Atler,Project11,2000000,Failed,2
3,A002,F,London,27,Alice,Luxumberg,Project2,2000000,Ongoing,2
4,A002,F,London,27,Alice,Luxumberg,Project6,680000,Failed,2
5,A003,M,Berlin,29,Tom,Sebestine,Project3,4500000,Finished,3
6,A003,M,Berlin,29,Tom,Sebestine,Project8,350000,Failed,3
7,A003,M,Berlin,29,Tom,Sebestine,Project10,300000,Finished,3
8,A004,F,Newyork,31,Nina,Adgra,Project4,5500000,Ongoing,2
9,A004,F,Newyork,31,Nina,Adgra,Project12,1000000,Ongoing,2
10,A004,F,Newyork,31,Nina,Adgra,Project13,3000000,Finished,2
11,A005,F,Madrid,30,Amy,Johny,Project5,3250500,Finished,3
12,A005,F,Madrid,30,Amy,Johny,Project7,400000,Finished,3
13,A005,F,Madrid,30,Amy,Johny,Project14,200000,Finished,3

# Task5: Add a new bonus column in the Final dataframe. Give a 5% bonus concerning project cost only to employees who have finished the projects.

In [399]:
# Make a new column 'Bonus' and add 5% to the cost only for those employees who has the status 'Finished'.
Final['Bonus'] = np.where(Final['Status'] == 'Finished', # if the condition met 
                          Final['Cost']*0.05,           # if the consdition is true
                          0)                            # otherwise no bonus
Final['Bonus'] # get the final result
Final

,ID,Gender,City,Age,First Name,Last Name,Project,Cost,Status,Designation level,Bonus
0,A001,M,Paris,25,John,Atler,Project1,1002000,Finished,2,50100.0
1,A001,M,Paris,25,John,Atler,Project9,2061714,Ongoing,2,0.0
2,A001,M,Paris,25,John,Atler,Project11,2000000,Failed,2,0.0
3,A002,F,London,27,Alice,Luxumberg,Project2,2000000,Ongoing,2,0.0
4,A002,F,London,27,Alice,Luxumberg,Project6,680000,Failed,2,0.0
5,A003,M,Berlin,29,Tom,Sebestine,Project3,4500000,Finished,3,225000.0
6,A003,M,Berlin,29,Tom,Sebestine,Project8,350000,Failed,3,0.0
7,A003,M,Berlin,29,Tom,Sebestine,Project10,300000,Finished,3,15000.0
8,A004,F,Newyork,31,Nina,Adgra,Project4,5500000,Ongoing,2,0.0
9,A004,F,Newyork,31,Nina,Adgra,Project12,1000000,Ongoing,2,0.0
10,A004,F,Newyork,31,Nina,Adgra,Project13,3000000,Finished,2,150000.0
11,A005,F,Madrid,30,Amy,Johny,Project5,3250500,Finished,3,162525.0
12,A005,F,Madrid,30,Amy,Johny,Project7,400000,Finished,3,20000.0
13,A005,F,Madrid,30,Amy,Johny,Project14,200000,Finished,3,10000.0

 # Task6: Demote the designation level by 1, whose projects have status “fail”. Delete the employees record whose designation level is above 4.

In [402]:
Final_1 = Final.copy()# <-- make a copy because the changes is not updated in the previous table.
Final_1['Designation level'] = np.where(Final_1['Status'] == 'Failed',# the condition if the status is Failed.
                      Final_1['Designation level'] - 1,   # if condition True, designation level reduce by 1.
                      Final_1['Designation level']) # if it's not true, no change in designation level.
Final_1['Designation level']
Final_1 # get the desired output

,ID,Gender,City,Age,First Name,Last Name,Project,Cost,Status,Designation level,Bonus
0,A001,M,Paris,25,John,Atler,Project1,1002000,Finished,2,50100.0
1,A001,M,Paris,25,John,Atler,Project9,2061714,Ongoing,2,0.0
2,A001,M,Paris,25,John,Atler,Project11,2000000,Failed,1,0.0
3,A002,F,London,27,Alice,Luxumberg,Project2,2000000,Ongoing,2,0.0
4,A002,F,London,27,Alice,Luxumberg,Project6,680000,Failed,1,0.0
5,A003,M,Berlin,29,Tom,Sebestine,Project3,4500000,Finished,3,225000.0
6,A003,M,Berlin,29,Tom,Sebestine,Project8,350000,Failed,2,0.0
7,A003,M,Berlin,29,Tom,Sebestine,Project10,300000,Finished,3,15000.0
8,A004,F,Newyork,31,Nina,Adgra,Project4,5500000,Ongoing,2,0.0
9,A004,F,Newyork,31,Nina,Adgra,Project12,1000000,Ongoing,2,0.0
10,A004,F,Newyork,31,Nina,Adgra,Project13,3000000,Finished,2,150000.0
11,A005,F,Madrid,30,Amy,Johny,Project5,3250500,Finished,3,162525.0
12,A005,F,Madrid,30,Amy,Johny,Project7,400000,Finished,3,20000.0
13,A005,F,Madrid,30,Amy,Johny,Project14,200000,Finished,3,10000.0

# Task7: Add “Mr.” and “Mrs.” to the first name column and drop the gender column.

In [404]:
"""Two ways to do it one is by using where function"""
# we use the 'where' condition to check the condition, where a condition is True, else replace with something else.
#Alternate way, we can use 'Loc' but 'loc' handled True and False separately. thats the major difference.
Final_2 = Final_1.copy()
Final_2['First Name'] = np.where(Final_2['Gender'] == 'M',# the condition if the Gender is M
                      'Mr. '+ Final_2['First Name'],   # if condition True
                      'Mrs. '+ Final_2['First Name'])# if the condition False
#Final_2['First Name']
Final_2 = Final_2.drop('Gender', axis='columns') # Drop the column Gender
Final_2# get the result

,ID,City,Age,First Name,Last Name,Project,Cost,Status,Designation level,Bonus
0,A001,Paris,25,Mr. John,Atler,Project1,1002000,Finished,2,50100.0
1,A001,Paris,25,Mr. John,Atler,Project9,2061714,Ongoing,2,0.0
2,A001,Paris,25,Mr. John,Atler,Project11,2000000,Failed,1,0.0
3,A002,London,27,Mrs. Alice,Luxumberg,Project2,2000000,Ongoing,2,0.0
4,A002,London,27,Mrs. Alice,Luxumberg,Project6,680000,Failed,1,0.0
5,A003,Berlin,29,Mr. Tom,Sebestine,Project3,4500000,Finished,3,225000.0
6,A003,Berlin,29,Mr. Tom,Sebestine,Project8,350000,Failed,2,0.0
7,A003,Berlin,29,Mr. Tom,Sebestine,Project10,300000,Finished,3,15000.0
8,A004,Newyork,31,Mrs. Nina,Adgra,Project4,5500000,Ongoing,2,0.0
9,A004,Newyork,31,Mrs. Nina,Adgra,Project12,1000000,Ongoing,2,0.0
10,A004,Newyork,31,Mrs. Nina,Adgra,Project13,3000000,Finished,2,150000.0
11,A005,Madrid,30,Mrs. Amy,Johny,Project5,3250500,Finished,3,162525.0
12,A005,Madrid,30,Mrs. Amy,Johny,Project7,400000,Finished,3,20000.0
13,A005,Madrid,30,Mrs. Amy,Johny,Project14,200000,Finished,3,10000.0

In [406]:
""" Another way by using apply function"""
Final_3 = Final_1.copy()
Final_3['First Name'] = Final_3.apply(
    lambda x: 'Mr. ' + x['First Name'] if (x['Gender'] == 'M' and not x['First Name'].startswith('Mr.'))
    else ('Mrs. ' + x['First Name'] if (x['Gender'] == 'F' and not x['First Name'].startswith('Mrs.'))
          else x['First Name']),
    axis=1
)
Final_3['First Name']
Final_3

,ID,Gender,City,Age,First Name,Last Name,Project,Cost,Status,Designation level,Bonus
0,A001,M,Paris,25,Mr. John,Atler,Project1,1002000,Finished,2,50100.0
1,A001,M,Paris,25,Mr. John,Atler,Project9,2061714,Ongoing,2,0.0
2,A001,M,Paris,25,Mr. John,Atler,Project11,2000000,Failed,1,0.0
3,A002,F,London,27,Mrs. Alice,Luxumberg,Project2,2000000,Ongoing,2,0.0
4,A002,F,London,27,Mrs. Alice,Luxumberg,Project6,680000,Failed,1,0.0
5,A003,M,Berlin,29,Mr. Tom,Sebestine,Project3,4500000,Finished,3,225000.0
6,A003,M,Berlin,29,Mr. Tom,Sebestine,Project8,350000,Failed,2,0.0
7,A003,M,Berlin,29,Mr. Tom,Sebestine,Project10,300000,Finished,3,15000.0
8,A004,F,Newyork,31,Mrs. Nina,Adgra,Project4,5500000,Ongoing,2,0.0
9,A004,F,Newyork,31,Mrs. Nina,Adgra,Project12,1000000,Ongoing,2,0.0
10,A004,F,Newyork,31,Mrs. Nina,Adgra,Project13,3000000,Finished,2,150000.0
11,A005,F,Madrid,30,Mrs. Amy,Johny,Project5,3250500,Finished,3,162525.0
12,A005,F,Madrid,30,Mrs. Amy,Johny,Project7,400000,Finished,3,20000.0
13,A005,F,Madrid,30,Mrs. Amy,Johny,Project14,200000,Finished,3,10000.0

 # Task8: Promote designation level by 1 for the employees whose age is more than 29 years.

In [408]:
Final_4 = Final_2.copy() # make a copy
def promote(x):          # define a fucntion 'promote'
    if x['Age'] > 29:    # Condition
        return x['Designation level'] + 1   # If the condition is greater than 29 then "+1" in the designation level.
    else:
        return x['Designation level']        # if the condition doesn't meet the condition then no change in the level of designation.

Final_4['Designation level'] = Final_4.apply(promote, axis=1) # apply function to each row 
Final_4 # get the desired output

,ID,City,Age,First Name,Last Name,Project,Cost,Status,Designation level,Bonus
0,A001,Paris,25,Mr. John,Atler,Project1,1002000,Finished,2,50100.0
1,A001,Paris,25,Mr. John,Atler,Project9,2061714,Ongoing,2,0.0
2,A001,Paris,25,Mr. John,Atler,Project11,2000000,Failed,1,0.0
3,A002,London,27,Mrs. Alice,Luxumberg,Project2,2000000,Ongoing,2,0.0
4,A002,London,27,Mrs. Alice,Luxumberg,Project6,680000,Failed,1,0.0
5,A003,Berlin,29,Mr. Tom,Sebestine,Project3,4500000,Finished,3,225000.0
6,A003,Berlin,29,Mr. Tom,Sebestine,Project8,350000,Failed,2,0.0
7,A003,Berlin,29,Mr. Tom,Sebestine,Project10,300000,Finished,3,15000.0
8,A004,Newyork,31,Mrs. Nina,Adgra,Project4,5500000,Ongoing,3,0.0
9,A004,Newyork,31,Mrs. Nina,Adgra,Project12,1000000,Ongoing,3,0.0
10,A004,Newyork,31,Mrs. Nina,Adgra,Project13,3000000,Finished,3,150000.0
11,A005,Madrid,30,Mrs. Amy,Johny,Project5,3250500,Finished,4,162525.0
12,A005,Madrid,30,Mrs. Amy,Johny,Project7,400000,Finished,4,20000.0
13,A005,Madrid,30,Mrs. Amy,Johny,Project14,200000,Finished,4,10000.0

# Task9: Add the cost of all projects for each Employee and save it in new dataframe “TotalProjCost” with three columns ID, First Name, and Total cost.

In [409]:
# reset.index()--convert those index values back into normal columns
TotalProjCost = Final_4.groupby(['ID', 'First Name'])['Cost'].sum().reset_index() # use groupby function
TotalProjCost.rename(columns={'Cost':'Total Cost'}, inplace=True) # Rename the cost to total cost.
TotalProjCost # get the final outcome with the total cost by grouping the ID and First name.

# we can also use pd.pivot_table(Final_4,index= ['ID', 'First Name'],values=['Cost'], aggfunc = sum)"""

# another way to do it 
#Totalprojcost = Final_1.groupby('First Name').agg({'Cost': 'sum'})

     ID  First Name  Total Cost
0  A001    Mr. John     5063714
1  A002  Mrs. Alice     2680000
2  A003     Mr. Tom     5150000
3  A004   Mrs. Nina     9500000
4  A005    Mrs. Amy     3850500

# Task10: Print all the employee details whose city name contains the letter “o” in it.

In [410]:
Final_5 = Final_4[Final_4['City'].str.contains('o')]
Final_5

,ID,City,Age,First Name,Last Name,Project,Cost,Status,Designation level,Bonus
3,A002,London,27,Mrs. Alice,Luxumberg,Project2,2000000,Ongoing,2,0.0
4,A002,London,27,Mrs. Alice,Luxumberg,Project6,680000,Failed,1,0.0
8,A004,Newyork,31,Mrs. Nina,Adgra,Project4,5500000,Ongoing,3,0.0
9,A004,Newyork,31,Mrs. Nina,Adgra,Project12,1000000,Ongoing,3,0.0
10,A004,Newyork,31,Mrs. Nina,Adgra,Project13,3000000,Finished,3,150000.0